package hw4;
/**
 -------------------------------------------------- Последовательности --------------------------------------------------
 1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
 2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
 3. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
 4. Создайте программу, выводящую на экран первые 20 элементов последовательности 2 4 8 16 32 64 128 ….
 5. Выведите на экран первые 20 членов последовательности Фибоначчи.
 ------------------------------------------------------------------------------------------------------------------------
 */
public class task {
    public static void main(String[] args) {
// 1
        for (int n = 1000; n < 1050; n = n + 3) {
            System.out.print(" " + n + " ");
        }
// 2
        System.out.println();
        for (int i = 1; i < 50; i = i + 3) {
            System.out.print(" " + i + " ");
        }
//3
        System.out.println();
        for (int b = 90;  b>0; b = b - 5) {
            System.out.print(" " + b + " ");
        }
//4

        System.out.println();
        for (int s = 2;  s<10000000; s = s*2) {
            System.out.print(" " + s + " ");
        }
//5
    /* class  Fib {
         public static void main(String[] args) {
             int n0 = 1, n1 = 1, n2;
             System.out.print(n0 + " " + n1 + " ");
             for (int i = 0; i < 18; i++) {
                 n2 = n0 + n1;
                 System.out.print(n2 + " ");
                 n0 = n1;
                 n1 = n2;
             }
             System.out.println();
         }
     }*/
    }}

