package hw5;

/**
 * Created by ПК on 27.04.2016.
 */
public class Hw5 {
    public static void main(String[] args) {
        //1. Вывести в консоль все парные числа одномерного массива
        //int[]mass=new int[4];
        int[]mass=new int[1];

        mass[0]='a';
        System.out.println(mass[0]);



    }
}
