package hw4;

/**
 * Created by User on 08.05.2016.
 */
public class Hw4T1 {
    public static void main(String[] args) {
        //1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
        for (int i = 1000; i < 10000; i = i + 3) {
            System.out.println(i);
        }
    }
}
