package hw4;

/**
 * Created by User on 07.05.2016.
 */
public class Hw4T3 {
    public static void main(String[] args) {
        //Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
        for (int i = 90; i > 0; i = i - 5) {
            System.out.println(i);
        }
    }
}
